Var a,b,x1,x2,Y1,Y2,F1,F2:real;// Присваиваем тии Real, вещественные числа
begin
a := 0.5;
b := 1.5;
x1 := 1.5;
x2 := 9.5;
Y1 := (exp(Ln(x1)*5))*(x1*(Arctan(a+x1))-sqrt(abs(x1-a))+Ln(exp(ln(abs(x1)+1)*2)));//Считаем функцию Y при x = 1.5
writeln('При x = 1.5 функция Y =', Y1);// Выводим на экран значение функции Y при x = 1.5
F1 := sqrt(a*exp(Ln(x1)*2)+b*x1)*exp(-a*x1)+Ln(abs(x1)+1);//Считаем функцию F при x = 1.5
writeln('При x = 1.5 функция F =', F1);// Выводим на экран значение функции F при x = 1.5
Y2 := (exp(Ln(x2)*5))*(x2*(Arctan(a+x2))-sqrt(abs(x2-a))+Ln(exp(ln(abs(x2)+1)*2)));//Считаем функцию Y при x = 9.5
writeln('При x = 9.5 функция Y =', Y2);// Выводим на экран значение функции Y при x = 9.5
F2 := sqrt(a*exp(Ln(x2)*2)+b*x2)*exp(-a*x2)+Ln(abs(x2)+1);//Считаем функцию F при x = 9.5
writeln('При x = 9.5 функция F =', F2);// Выводим на экран значение функции F при x = 9.5
end.